{
	"tafseer": [
		{
			"id": 5189,
			"surah": 63,
			"ayat": 1,
			"tafsir": "Allah explained that when the hypocrites were present at the assembly of the Prophet, including 'Abdullah bin Ubay, they acknowledged with a statement that did not contain the slightest doubt that Muhammad was truly a messenger from Allah, had been given revelation, and sent down to him. the Qur'an as a mercy to the servants of Allah. Allah has previously emphasized that Muhammad is His messenger or messenger to all mankind, giving good news and threats to save them from going astray, and bringing them to the right direction. Allah knows the lies of the hypocrites in their confessions. They are really different in other mouths in the heart. A hypocrite is someone who has faith outwardly, but not inwardly."
		   },
		   {
			"id": 5190,
			"surah": 63,
			"ayat": 2,
			"tafsir": "In this verse, Allah explains that in strengthening their false confessions, those hypocrites dared to swear an oath, but this was only as a shield to save themselves from being sentenced to death, detention, or having their property taken as ganimah, as the punishment handed down to Unbelievers. Qatadah said, \"Every time the hypocrites will be punished for their deeds, they put forward a false oath to save their life, blood and property.\" Their actions are not limited by that. They also prevent people from entering and embracing Islam. This verse closes with the assertion that the actions of the hypocrites are the most evil deeds. They would rather choose disbelief than faith, and reveal what is different in their hearts. In this world they will be disappointed and in the hereafter they will regret it. They will be humiliated in public by declaring their hypocrisy to the believers in this world. Meanwhile, in the afterlife, they will be put into hell. In line with this verse the word of Allah: Indeed, the hypocrites are (placed) at the lowest level of hell. And you will find no helper for them. (an-Nisa'\/4: 145) Allah's Word: Allah promises (threats) male and female hypocrites and disbelievers with Hell Hell. They live in it. Sufficient (hell) for them. Allah cursed them; and they will have everlasting punishment. (at-Taubah\/9: 68)"
		   },
		   {
			"id": 5191,
			"surah": 63,
			"ayat": 3,
			"tafsir": "In this verse, Allah explains that the evil and despicable deeds of the hypocrites were because they showed faith outwardly, then they disbelieved and disbelieved in their hearts. They had indeed believed, then they disbelieved and hid their disbelief which caused their hearts to be sealed shut so that they could no longer understand and know what was good and what was bad, and so on. Finally they are no different from those who are mute, deaf and blind, as mentioned in the word of Allah: And the parable of (callers) those who disbelieve is like (herdsmen) shouting (animals) who hear nothing but the call and scream. (They are) deaf, dumb and blind, so they don't understand. (al-Baqarah\/2: 171)"
		   },
		   {
			"id": 5192,
			"surah": 63,
			"ayat": 4,
			"tafsir": "In this verse, Allah explains that the hypocrites look very amazing. Their bodies were well-built, sympathetic, and eloquent and likable. When they speak, people are happy to hear it because the speech is orderly, interesting, and not boring. They are like leaning wood, objects that have shape but are lifeless. This is usually used as a parable for people who look good, but their deeds are bad. Outwardly beautiful, but his heart is rotten, just like wood inside which is empty, looks beautiful, but cannot be used, nothing good and useful can be expected from it. Whenever there are words that are amar ma'ruf nahi mungkar, they think that those words are directed at him. They are afraid that their position and rank will be threatened and their secret will be exposed. The scorn and ridicule of them will come and they will be the butt of them. Allah says: They are miserly towards you. When fear (danger) comes, you see them looking at you with upturned eyes like a person fainted because he is about to die, and when the fear is gone, they abuse you with their sharp tongues. (al-Ahzab\/33: 19) They are actually enemies, so be careful with them, don't be swayed by their hospitality, and don't be taken in by their flattery. They seem to smile, but in their hearts there is a deep grudge, an evil intention that leads to death. They were cursed by Allah and far from His grace, because of their very evil deeds. Enlightenment and explanation about the truth have been sufficiently given to them, but they throw away the truth, and carry out the wrong that is forbidden by Allah."
		   },
		   {
			"id": 5193,
			"surah": 63,
			"ayat": 5,
			"tafsir": "When the hypocrites were invited to come to the Messenger of Allah so that he would ask Allah for forgiveness for the sins they had committed, they flatly refused the invitation. They turned their heads away in a manner that conveyed arrogance and arrogance. This is also mentioned in the word of Allah: And when it is said to them, \"Come (obey) to what Allah has sent down and (obey) to the Messenger,\" (undoubtedly) you (Muhammad) will see the hypocrites blocking you hard. (an-Nisa'\/4: 61)"
		   },
		   {
			"id": 5194,
			"surah": 63,
			"ayat": 6,
			"tafsir": "Allah explains that for hypocrites, asking for forgiveness or not, it's the same. Allah will not forgive them. He has ordained them to be among those who are wretched because of their sinful deeds and has shown clearly the hypocrisy and denial in their hidden hearts. God will not guide wicked people whose work is only to do evil, who do not heed good advice, and will not heed the warnings given to them. His words are full of lies and outrageous denial, as Allah says: Verily, Allah does not guide liars and those who are very disbelieving. (az-Zumar\/39: 3) Allah's Word: Surely Allah does not guide those who transgress and are liars. (Gafir\/40: 28) And the word of Allah: (It's the same) you (Muhammad) ask forgiveness for them or don't ask forgiveness for them. Even if you ask forgiveness for them seventy times, Allah will not forgive them. That is because they disbelieve (disbelieve) in Allah and His Messenger. And Allah does not guide the wicked. (at-Taubah\/9: 80)"
		   },
		   {
			"id": 5195,
			"surah": 63,
			"ayat": 7,
			"tafsir": "Allah explained that the hypocrites had always advised the Ansar not to feed the Muhajirin who came with Muhammad from Mecca and let them suffer from hunger, so they would leave the Prophet. Suggestions and assumptions of hypocrites are wrong. They do not know that everything in the heavens and on earth belongs to Allah. In His hand is the key to the treasury of human sustenance. No one can give anything to another except by His will. They do not want to understand the sunatullah that applies to His creatures. Allah has guaranteed the sustenance of His servants wherever they are. Every time they work and try, they will get their sustenance."
		   },
		   {
			"id": 5196,
			"surah": 63,
			"ayat": 8,
			"tafsir": "In this verse, Allah explained that 'Abdullah bin Ubay and his followers planned that when they returned to Medina from the Bani Musthaliq war, they would expel the believers from Medina. They feel and think that they are the strong, mighty and noble, while the believers are weak and despicable. They do not realize that power, might and glory are in the hands of Allah and His messengers, as well as the believers whom He has glorified. It is narrated that 'Abdullah son of 'Abdullah bin Ubay was a true believer. He once pulled out a sword to threaten his father, 'Abdullah bin Ubay, when they were close to Medina and said, \"By Allah, I will not put my sword in its scabbard, so that you say, 'That Muhammad is the noble one and I am the lowly one. \" 'Abdullah the son of 'Abdullah bin Ubay remained in his attitude, so his father uttered the confession that Muhammad was the noble and he was the despicable. The hypocrites do not know that the real glory belongs to Allah, His Messenger and the believers. The final victory belongs to those who are pious and Allah will give help to those who uphold His religion, as explained in another verse: Allah has decreed, \"I and My messengers will surely win.\" Truly, Allah is Powerful, Mighty. (al-Mujalah\/58: 21)"
		   },
		   {
			"id": 5197,
			"surah": 63,
			"ayat": 9,
			"tafsir": "Allah reminds us that being busy taking care of property and paying attention to the problems of children should not make humans neglect their obligations to Allah or even not fulfill them. Their attention to the world and the hereafter should be balanced, as stated in a history: Charity (worldly practice) is like the practice of someone who thinks that he will not die forever. However, be vigilant like the vigilance of someone who will die tomorrow. (Al-Baihaqi narration from Abdullah bin Ibn 'Amru bin al-'As) In another hadith, the Prophet said: It is not the best person among you who leaves (interests) in his world because of the hereafter, and instead leaves his (interests) in the hereafter because of affairs his world, so that he gets both (shares) at once, this is because the life of the world is a ware that conveys to the afterlife and you should not be a burden to others. (History of Ibn 'Asakir from Anas bin Malik) Herein lies the privilege and superiority of the religion brought by our master the Prophet Muhammad, namely Islam. A religion that does not want its people to be materialistic, whose thoughts and efforts are only aimed at accumulating worldly wealth and pleasures, just like the Jews. Islam is also a religion that does not justify its adherents only concerned with the hereafter, immersed in spirituality, distancing themselves from the delights of life, remaining single and not marrying, as is the case with Christians. Allah said: O children of Adam! Wear your nice clothes every (entering) the mosque, eat and drink, but don't overdo it. (al-A'raf\/7: 31) Allah's Word: Say (Muhammad), \"Who forbids the jewelery from Allah which has been prepared for His servants and the good sustenance? (al-A'raf\/7 : 32) Allah confirms at the end of verse 9 that people who are very concerned with world affairs and abandon the happiness of the hereafter, mean that they have invited Allah's wrath. They will lose out because they exchange something that is eternal for something that is perishable and vanishes."
		   },
		   {
			"id": 5198,
			"surah": 63,
			"ayat": 10,
			"tafsir": "In this verse, Allah recommends that believers spend some of the sustenance that has been bestowed upon them, as a sign of gratitude for His blessings. This can be in the form of sponsoring orphans, poor people, and so on. This is a provision for the hereafter to be enjoyed in the next day. Do not let this wealth just be piled up to be inherited by heirs who are not necessarily going to make the best use of it and bring joy, or to be wasted which will result in disappointment. Wealth that is in a person, no matter how much, only three kinds that belong to him, as it is narrated that the Prophet said: Mutharrif bin Syu'bah narrated from his father saying, \"I came to the Prophet saw, while he was reading the verse 'alhakumut-takatsur.\" Then the Prophet said, \"(There is a) human saying 'my treasures.\" The Prophet said again, \"O people, you do not have wealth (which you collect), but what you eat is gone, what you wear is worn out, and what you give away is gone.\" (Muslim History) Spending wealth for the benefit of this world and the hereafter, do not delay until death comes. And don't wish that his life could be extended or his death could still be postponed. He must spend his wealth on what Allah pleases, and do good deeds so that he can be ranked among the pious before death comes, because when death has reached its limit, it can no longer be changed, brought forward, or postponed."
		   },
		   {
			"id": 5199,
			"surah": 63,
			"ayat": 11,
			"tafsir": "This verse emphasizes that God will not delay a person's death when he reaches his death. Therefore, be prepared to face death. Collect as many supplies as possible in the form of good deeds that will be brought and that will be beneficial in the afterlife. Allah's Word: So as for those whose scales (goodness) are heavy, then he is in a satisfying (happy) life. And as for those whose scales (goodness) are light, then the place of their return is the Hawiyah hell. And do you know what Hawiyah's hell is? (That is) a very hot fire. (al-Qari'ah\/101: 6-11) This eleventh verse closes with the affirmation that Allah is All-Knowing of what His servants do. All of that will be rewarded on the next day, according to his deeds. If you are good you will be put in heaven, and if you are bad you will be put in hell."
		   }
	]
}
